## Infrastructure updates
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details>
<summary>Show infrastructure changes plan</summary>

```

aws_cloudwatch_log_group.default_log_group: Refreshing state... [id=confluence-chat-staging]
aws_vpc.main_vpc: Refreshing state... [id=vpc-0d334a52016908598]
data.aws_iam_policy_document.ec2_default_policy: Reading...
data.aws_iam_policy_document.assume_role: Reading...
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1903849331]
data.aws_iam_policy_document.ec2_default_policy: Read complete after 0s [id=4157981590]
aws_iam_role.ec2_role: Refreshing state... [id=confluence-chatstagingEC2AccessRole]
aws_iam_policy.ec2_role_policy: Refreshing state... [id=arn:aws:iam::937191605656:policy/confluence-chatstagingEC2Default]
aws_cloudwatch_log_stream.nginx_logstream: Refreshing state... [id=nginx]
aws_cloudwatch_log_stream.backend_logstream: Refreshing state... [id=app]
aws_iam_role_policy_attachment.ec2_policy_attach: Refreshing state... [id=confluence-chatstagingEC2AccessRole-20250125192157243800000001]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=confluence-chatstagingDefault]
aws_internet_gateway.inet_gateway: Refreshing state... [id=igw-0943757f13afe692d]
aws_security_group.main_security_group: Refreshing state... [id=sg-044eefdc3d354ab17]
aws_subnet.main_subnet: Refreshing state... [id=subnet-014e243248a8c368d]
aws_route_table.main_route_table: Refreshing state... [id=rtb-029c4b9d39ccb7492]
aws_route_table_association.route_table_association_1: Refreshing state... [id=rtbassoc-07ebd4e702e193cf4]
aws_instance.server: Refreshing state... [id=i-09bf7eb1c9b16ea33]
aws_eip.server_eip: Refreshing state... [id=eipalloc-00dca7d3c608be56a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.server_eip will be updated in-place
  ~ resource "aws_eip" "server_eip" {
        id                       = "eipalloc-00dca7d3c608be56a"
      + instance                 = (known after apply)
        tags                     = {}
        # (15 unchanged attributes hidden)
    }

  # aws_instance.server is tainted, so must be replaced
-/+ resource "aws_instance" "server" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:937191605656:instance/i-09bf7eb1c9b16ea33" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-09bf7eb1c9b16ea33" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0b7dd788b4c989ff8" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-49.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.49" -> (known after apply)
      ~ public_dns                           = "ec2-3-239-238-38.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.239.238.38" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "confluence-chat-staging-app"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
        # (12 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0dc8e9aa00b796fb6" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Author: @gixproject*